//
//  shipdata.swift
//  dictionary
//
//  Created by 関根康太 on 2017/07/11.
//  Copyright © 2017年 関根康太. All rights reserved.
//

import UIKit

class shipdata: NSObject {
    var content = ["暁と言う駆逐艦は暁型１番艦、改名する前の山彦型１番艦の山彦、吹雪型駆逐艦21番艦（特III型、暁型）がありここでは暁型１番艦を説明する。　　当初の艦名は第十三号駆逐艦。1901年11月13日に進水し「暁」と命名。同年12月14日、イギリスのヤーロー社で竣工し、軍艦に編入され駆逐艦に類別。1902年1月25日、日本へ回航。同年5月7日、横須賀に到着。　　　排水量:常備,363トン  全長:67.2m  全幅:6.3m  吃水:1.7m  主缶:ヤーロー式石炭専焼缶4基  主機:2軸推進、6,000shp  最大速力:31ノット　　乗員:62名　　兵装:8.0cm単装砲1基,57mm単装砲5基,45cm水上発射管2門", "響（ひびき）は、日本海軍の駆逐艦。吹雪型（特型）の22番艦（III型の2番艦）である。この名を持つ日本海軍の艦船としては神風型駆逐艦 (初代)「響」に続いて2隻目。太平洋戦争で戦火により3度の甚大な損傷を蒙ったにもかかわらず沈没せず、終戦まで生き残った強運ぶりと活躍から「不沈艦」、「不死鳥」、「戦争を生きのびる運命の艦」などと形容された。　　　排水量:基準1,680t 公試1,980t  全長:118m  全幅:10.36m　　吃水:3.2m　　機関:ロ号艦本式缶3基,艦本式タービン2基2軸,50,000hp　　速力:38.0ノット　　乗員:219名　　兵装:50口径12.7cm連装砲 3基6門,13mm単装機銃 2挺,61cm3連装魚雷発射管 3基", "雷（いかづち）は、日本海軍の駆逐艦。一等駆逐艦吹雪型（初雪型）の23番艦（III型の3番艦）である。この名を持つ日本海軍の艦船としては雷型駆逐艦「雷」に続いて2隻目。   排水量:基準1,680t 公試1,980t　　全長:118m　　全幅:10.36m　　吃水:3.2m　　機関:ロ号艦本式缶3基 艦本式タービン2基2軸 50,000hp　　速力:38.0ノット　　乗員:219名　　兵装:50口径12.7cm連装砲 3基6門,13mm単装機銃 2挺,61cm3連装魚雷発射管3基", "電（いなづま）は、日本海軍の駆逐艦。一等駆逐艦吹雪型(初雪型)（特型）の24番艦（III型の4番艦）、朧型（吹雪型の後期型）。この名を持つ日本海軍の艦船としては雷型駆逐艦「電」に続いて2隻目。ロンドン海軍軍縮条約により、駆逐艦は「1500トンを超える艦は、合計排水量の16パーセントまで」という制限が設けられ特型の増産が不可能となり、本艦をもって建造が打ち切られた。スラバヤ沖海戦では、撃沈された敵乗組員376名を救助したことで知られている。　　　排水量:基準1,680t 公試1,980t　　全長:118m　　全幅:10.36m　　吃水:3.2m　　機関:ロ号艦本式缶3基、艦本式タービン2基2軸、50,000hp　　速力:38.0ノット　　乗員:219名　　兵装:50口径12.7cm連装砲3基6門,13mm単装機銃2挺,61cm3連装魚雷発射管3基"]
}
